[
    {
        "title": "Winter celebration",
        "date": "2017-12-01 5:00pm",
        "description": "A night of family fun to celebrate the winter season.  All are welcome.  Free admission.",
        "location": "City Hall"
    },
    {
        "title": "Artist Salon",
        "date": "2017-05-04 7-9:00pm",
        "description": "A monthly program for emerging and established visual artists to socialize,\n        share resources and build up the local arts community. Guest speakers are invited\n        throughout the series, with each month focusing on a different topic or theme. RSVP required\n        due to limited spaces.",
        "location": "Richmond Art Gallery"
    },
    {
        "title": "Walk Richmond - Middle Arm Dyke",
        "date": "2017-11-18 10:00am",
        "description": "Follow the Fraser River on this picturesque walk that passes\n      by the Richmond Olympic Oval offering spectacular views of the North Shore\n      Mountains. Meeting spot: Playground at Dover Park, 5855 Dover Crescent\n      (across from the Richmond Works Yard).",
        "location": "Dover Neighbourhood Park"
    },
    {
        "title": "Christmas Craft Fair",
        "date": "2017-11-25 10:00am - 4:00pm",
        "description": "Up to 170 vendors all with home-made crafts, baking, jewellery,\n      \"foodie\" items and more. This is a fun event ideal as a pre-Christmas event\n      and great shopping. Concession stand available with yummy treats.",
        "location": "Steveston Community Centre"
    },
    {
        "title": "Gateway Theatre Presents: Sink or Swim",
        "date": "2017-11-16 to 2017-11-25",
        "description": "Beverley Elliott last graced the Gateway Studio in 2015 with her smash hit,\n      ...Didn't see that coming. Known by her fans around the world for her recurring\n      role as \"Granny\" on ABC Television's hit series, Once Upon a Time, Beverley is\n      excited to bring her latest show, Sink or Swim, to Gateway this year.\n\n      Sink or Swim is an evening of songs and stories from a singular talent.\n      Beverley vividly reveals all the fears and foibles of five-year-old \"Smelly Elliott\".\n      \"It's Little House on the Prairie meets Lord of the Flies,\" says Elliott,\n      as she trades the safety of the family farm for the thugs of a one-room school.\n      In this poignant, playful, and relatable prequel to ...Didn't see that coming,\n      Elliott navigates the uncharted waters, big adventures, betrayals and\n      epiphanies that shape us all into the adults we become, and answers\n      life's big questions like \"Why did I eat the fish food?\"",
        "location": "Gateway Theatre"
    },
    {
        "title": "Winter Hayrides",
        "date": "2017-12-07 to 2017-12-08",
        "description": "Hop board for this old-time favourite experience around\n      Steveston Village that includes a sing-a-long and viewing of local holiday displays.",
        "location": "Steveston Community Centre"
    },
    {
        "title": "Lighting of the Fire Hall No. 5 (Hamilton)",
        "date": "2017-12-05 3:30pm - 5:00pm",
        "description": "Bring your friends and family out to the Hamilton Fire Hall\n      No. 5 and join us in celebrating the lighting of this building with an\n      afternoon of activities, entertainment and refreshments.",
        "location": "Fire Hall No. 5"
    }
]